In [16]:
from env1 import get_db_url
import pandas as pd
import numpy as np

from pydataset import data

In [17]:
import env1

In [18]:
from env1 import user, password, host

In [20]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [21]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [23]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role
0  1.0      bob      1.0      admin
1  2.0      joe      2.0     author
2  3.0    sally      3.0   reviewer
3  4.0     adam      3.0   reviewer
4  5.0     jane      NaN        NaN
5  6.0     mike      NaN        NaN
6  NaN      NaN      4.0  commenter

In [24]:

right_join = pd.merge(users, roles, left_on='role_id', right_on='id', how='right', indicator=True)
right_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [25]:


outer_join = pd.merge(users, roles, left_on='role_id', right_on='id', how='outer', indicator=True)
outer_join

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [ ]:
pd.merge(users, roles, left_on='id', right_on='id', how='outer', indicator=True)

In [ ]:
mpg = data('mpg')

In [ ]:
mpg

In [ ]:
mpg.info()

In [ ]:
mpg.shape

In [ ]:
mpg.columns

In [ ]:
mpg = mpg.rename(columns = {'hwy': 'highway'})

In [ ]:
mpg = mpg.rename(columns = {'cty': 'city', 'drv':'drive'})

In [ ]:
mpg.describe()

In [ ]:
mpg.manufacturer.nunique()  ## Nunique()

In [ ]:
mpg.model.nunique()

In [ ]:
mpg['mileage_difference'] = mpg.highway - mpg.city

In [ ]:
mpg

In [ ]:
mpg['average_mileage'] = (mpg.city + mpg.highway) / 2
mpg.head()

In [ ]:
mpg.groupby('manufacturer')[['average_mileage']].mean().sort_values('average_mileage', ascending = False)

In [ ]:
#8 

x = mpg[['manufacturer', 'average_mileage']]

In [ ]:
mpg['is_automatic'] = np.where(mpg.trans.str.startswith('auto'), 'Auto', 'Manual')
mpg.head()

In [ ]:
mpg.groupby('manufacturer').average_mileage.mean().nlargest(n=1)

In [ ]:
mpg.groupby('is_automatic').average_mileage.mean()

# # exercises iii

In [40]:
pd.read_sql('show tables', env1.get_db_url('chipotle'))

  Tables_in_chipotle
0             orders

In [41]:
querry = '''
select * 
from orders;
'''

In [42]:


orders = pd.read_sql(sql, env1.get_db_url('chipotle'))
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [43]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   object
dtypes: int64(3), object(3)
memory usage: 216.8+ KB

In [50]:
#2

orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
orders.head()

/var/folders/nr/4dgzb75x0x5b5kl5610rvf340000gn/T/ipykernel_3226/3601981582.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98

In [49]:
orders.groupby('order_id').item_price.sum()

order_id
1       $2.39 $3.39 $3.39 $2.39
2                        $16.98
3                  $10.98 $1.69
4                  $11.75 $9.25
5                   $9.25 $4.45
                  ...
1830              $11.75 $11.25
1831          $9.25 $2.15 $1.50
1832                $8.75 $4.45
1833              $11.75 $11.75
1834         $11.25 $8.75 $8.75
Name: item_price, Length: 1834, dtype: object

In [57]:
#3

orders.groupby('item_name').quantity.sum().sort_values(ascending = False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

In [32]:
outer_join = pd.merge(employees.employees, titles.employees, left_on='role_id', right_on='id', how='outer', indicator=True)
outer_join

NameError: name 'titles' is not defined

In [39]:
employees.columns

NameError: name 'employees' is not defined